[
    {
    "uuid": "dc2f290c-ca7c-4c28-a3e9-1448cb5bd077",
    "title": "Fumbling bizarre disgusting unarmed haloed shrill distinct spacial trousers 1922",
    "description": "Proident aliqua non fugiat adipisicing anim occaecat labore anim sunt minim mollit elit ipsum adipisicing irure tempor amet mollit dolore do mollit ut quis ex quis esse veniam adipisicing elit ea excepteur ut consectetur occaecat velit laborum occaecat.",
    "cover_image_url": "https://picsum.photos/id/0/329/220",
    "price": {
      "currency": "EUR",
      "originalValue": "595.00",
      "originalPrice": "€ 595.00",
      "discountValue": "476.00",
      "discountPrice": "€ 476.00"
    }
  },
  {
    "uuid": "2a303854-f01d-4468-97d9-cec1207c6880",
    "title": "Quixotic miniature detailed laughable faded aquatic wrathful alleged oval wing 6700",
    "description": "Culpa officia deserunt exercitation eu eiusmod aute aute id occaecat incididunt nulla incididunt laboris anim eu voluptate et adipisicing aute velit id consequat nostrud magna excepteur do cillum.",
    "cover_image_url": "https://picsum.photos/id/1/329/220",
    "price": {
      "currency": "EUR",
      "originalValue": "171.00",
      "originalPrice": "€ 171.00",
      "discountValue": "136.80",
      "discountPrice": "€ 136.80"
    }
  },
  {
    "uuid": "1c56ba71-b9c2-4428-8ca7-f1c47e336ad5",
    "title": "Shaky nondescript steep perfect rosy encouraging terrible wacky utopian joyful past happy absent measure 4522",
    "description": "Velit occaecat occaecat nulla nulla incididunt adipisicing enim ex deserunt qui mollit occaecat irure est do laborum mollit tempor adipisicing Lorem commodo adipisicing id laborum minim quis incididunt incididunt commodo nostrud.",
    "cover_image_url": "https://picsum.photos/id/10/329/220",
    "price": {
      "currency": "EUR",
      "originalValue": "263.00",
      "originalPrice": "€ 263.00",
      "discountValue": "210.40",
      "discountPrice": "€ 210.40"
    }
  },
  {
    "uuid": "00c478a8-d729-4306-92bc-91df4a78ccdc",
    "title": "Nonchalant subsequent nonchalant squealing unable fearless careless puzzled dry blushing tender thriving mindless pushy smell 1631",
    "description": "Sunt sit ipsum occaecat ex labore qui officia eiusmod consequat aliquip ipsum pariatur voluptate sunt ea magna officia duis consectetur.",
    "cover_image_url": "https://picsum.photos/id/100/329/220",
    "price": {
      "currency": "EUR",
      "originalValue": "376.00",
      "originalPrice": "€ 376.00",
      "discountValue": "300.80",
      "discountPrice": "€ 300.80"
    }
  },
  {
    "uuid": "3865121b-cb68-43be-a8c3-c216fe57e973",
    "title": "Khaki substantial draconian petite giant scattered capricious natural noxious psychotic important comfortable reach cushion 6255",
    "description": "Ea eu magna culpa dolor est elit laborum esse officia sit Lorem do tempor voluptate commodo occaecat ea mollit aliqua quis amet in ipsum enim dolor.",
    "cover_image_url": "https://picsum.photos/id/1000/329/220",
    "price": {
      "currency": "EUR",
      "originalValue": "192.00",
      "originalPrice": "€ 192.00",
      "discountValue": "153.60",
      "discountPrice": "€ 153.60"
    }
  },
  {
    "uuid": "71e3a620-9746-4969-8eff-08d2652344e5",
    "title": "Inexpensive whole careful spotted uplifting plastic chivalrous succinct auspicious delicate cheap opposite fair fantastic border 9677",
    "description": "Minim elit officia eu commodo ea ex Lorem ullamco cupidatat adipisicing amet aliquip eiusmod est ullamco dolor eu occaecat fugiat consequat nostrud nostrud sunt laboris officia irure qui aliqua.",
    "cover_image_url": "https://picsum.photos/id/1001/329/220",
    "price": {
      "currency": "EUR",
      "originalValue": "609.00",
      "originalPrice": "€ 609.00",
      "discountValue": "487.20",
      "discountPrice": "€ 487.20"
    }
  },
]